Revit 2027 API
TableSectionData.FirstColumnNumber Property
 The first column in this section of the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int FirstColumnNumber { get; }
Public ReadOnly Property FirstColumnNumber As Integer
	Get
public:
property int FirstColumnNumber {
	int get ();
}
member FirstColumnNumber : int with get
Property Value
Int32
Remarks
 Some table sections have column 0 as their first column while others start with column 1.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace